<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
          "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html  xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en"><head>
<title></title>
<meta http-equiv="content-type" content="text/html;charset=utf-8"/>
<meta http-equiv="Content-Style-Type" content="text/css"/>
</head>
<body>
<div align="left" align="left"><font size="2"><span style=" font-size:10pt">Zapouzd&#345;en&#237; (encapsulation) je seskupen&#237; souvisej&#237;c&#237;ch idej&#237; do jedn&#233; jednotky, na kterou se lze n&#225;sledn&#283; 
odkazovat jedin&#253;m n&#225;zvem.</span></font></div>
<div align="left" align="left"><font size="2"><span style=" font-size:10pt"><br />
</span></font></div>
<div align="left" align="left"><font size="2"><span style=" font-size:10pt">Softwarov&#233;zapouzd&#345;en&#237; je vyu&#382;&#237;v&#225;no ji&#382; od samotn&#233;ho po&#269;&#225;tk&#367; programov&#225;n&#237;. D&#367;vodem bylo to, &#382;e si 
program&#225;to&#345;i brzo v&#353;imli, &#382;e n&#283;kter&#233; &#250;seky instrukc&#237; se opakuj&#237;. Tyto opakuj&#237;c&#237; sekvence instrukc&#237; proto 
za&#269;ali um&#237;st&#328;ovat&#160; mimo hlavn&#237; program pod jedno jm&#233;no a celou sekvenci jenom jednou. Potom sta&#269;ilo v 
hlavn&#237;m programu si zavolat tuto sekvenci a po jej&#237;m vykon&#225;n&#237; se vr&#225;tit zp&#283;t. A to se mohlo ud&#283;lat 
v&#237;cekr&#225;t. T&#283;mto sekvenc&#237;m instrukc&#237; se za&#269;alo &#345;&#237;kat podprogram. V&#253;sledkem bylo v&#253;razn&#233; zkr&#225;cen&#237; 
programu, co&#382; v po&#269;&#225;tku po&#269;&#237;ta&#269;ov&#233;ho v&#283;ku bylo nesm&#237;rn&#283; cenn&#233;, proto&#382;e pam&#283;&#357;ov&#233; kapacity tehdej&#353;&#237;ch 
po&#269;&#237;ta&#269;&#367; byly velmi mal&#233; a cena pam&#283;t&#237; vysok&#225;. Teprve pozd&#283;ji si program&#225;to&#345;i v&#353;imli, &#382;e podprogramy 
tvo&#345;&#237; moduly, kter&#233; realizuj&#237; ur&#269;itou jednu my&#353;lenku neboli ideu. T&#237;m se do programov&#225;n&#237; zavedla prvn&#237; 
jednoduch&#225; &#250;rove&#328; abstrakce. Co&#382; bylo stra&#353;n&#283; d&#367;le&#382;it&#233;, proto&#382;e program&#225;to&#345;i si t&#237;m p&#225;dem mohli tvo&#345;it 
knihovny podprogram&#367;, kter&#233; za&#269;aly jakoby roz&#353;i&#345;ovt p&#367;vodn&#237; programovac&#237; jazyk o dal&#353;&#237; schopnosti. </span></font></div>
<div align="left" align="left"><font size="2"><span style=" font-size:10pt"><br />
</span></font></div>
<div align="left" align="left"><font size="2"><span style=" font-size:10pt">Objektov&#283; orientovav&#233; zapouzd&#345;en&#237; je zabalen&#237; operac&#237; a atribut&#367; p&#345;edstavuj&#237;c&#237; n&#283;jak&#253; stav jednoho typu 
objektu, tak&#382;e dan&#253; stav je p&#345;&#237;stupn&#253; &#269;i upraviteln&#253; pouze prost&#345;ednictv&#237;m rozhran&#237; poskytovan&#233;ho 
zapouzd&#345;en&#237;m.</span></font></div>
<div align="left" align="left"><font size="2"><span style=" font-size:10pt"><br />
</span></font></div>
<div align="left" align="left">&nbsp;&nbsp;</div>
</body>
</html>
