<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
          "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html  xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en"><head>
<title></title>
<meta http-equiv="content-type" content="text/html;charset=utf-8"/>
<meta http-equiv="Content-Style-Type" content="text/css"/>
</head>
<body>
<div align="left" align="left"><font size="3"><span style=" font-size:12pt">Jednotkov&#233; testy&#160; JUnit jsou v&#253;konn&#253;m n&#225;strojem v&#253;vojov&#253;ch technik&#160; &#345;&#237;zen&#237; v&#253;voje 
softwaru testy (<i>test-driven development)</i> a &quot;<i>Extr&#233;mn&#237;ho programov&#225;n&#237;</i>&quot;.</span></font></div>
<div align="left" align="left"><font size="3"><span style=" font-size:12pt"><br />
</span></font></div>
<div align="left" align="left"><font size="3"><span style=" font-size:12pt">JUnit byl pozd&#283;ji portov&#225;n na mnoho dal&#353;&#237;ch jazyk&#367;, nap&#345;. C# (NUnit), Python (PyUnit), 
Fortran (fUnit), Perl (Test::Class a Test::Unit) a C++ (CPPUnit). Tato rodina framework&#367; 
pro jednotkov&#233; testy byla pojmenov&#225;na xUnit.</span></font></div>
<div align="left" align="left"><font size="3"><span style=" font-size:12pt"><br />
</span></font></div>
<div align="left" align="left"><font size="3"><span style=" font-size:12pt">P&#345;evzato z http://cs.wikipedia.org/wiki/Unit_testing</span></font></div>
<div align="left" align="left"><font size="3"><span style=" font-size:12pt"><i>Slovn&#237; spojen&#237; unit testing se p&#345;i programov&#225;n&#237; pou&#382;&#237;v&#225; jako pojem a v &#269;esk&#233;m jazyce 
pravd&#283;podobn&#283; dosud nem&#225; ust&#225;len&#253; p&#345;eklad. Pojem by se dal p&#345;elo&#382;it jako testov&#225;n&#237; 
jednotek, testov&#225;n&#237; aplika&#269;n&#237;ch jednotek, doslovn&#283; jako jednotkov&#233; testov&#225;n&#237;. Unit 
testing je &#269;innost&#237; souvisej&#237;c&#237; s v&#253;vojem aplika&#269;n&#237;ch program&#367;. Koncov&#237; u&#382;ivatel&#233; 
program&#367; se s n&#237;m nesetk&#225;vaj&#237;.</i></span></font></div>
<div align="left" align="left"><font size="3"><span style=" font-size:12pt"><i><br />
</i></span></font></div>
<div align="left" align="left"><font size="3"><span style=" font-size:12pt"><i>Pod pojem unit testing se zahrnuj&#237; n&#225;stroje, metodika a &#269;innost, jej&#237;m&#382; c&#237;lem je 
ov&#283;&#345;ov&#225;n&#237; spr&#225;vn&#233; funk&#269;nosti d&#237;l&#269;&#237;ch &#269;&#225;st&#237; neboli jednotek zdrojov&#233;ho textu.</i></span></font></div>
<div align="left" align="left"><font size="3"><span style=" font-size:12pt"><i><br />
</i></span></font></div>
<div align="left" align="left"><font size="3"><span style=" font-size:12pt"><i>Technicky &#345;e&#269;eno, za jednotku by se m&#283;la pova&#382;ovat samostatn&#283; testovateln&#225; &#269;&#225;st 
aplika&#269;n&#237;ho programu. Z pohledu procedur&#225;ln&#237;ho programov&#225;n&#237; m&#367;&#382;e b&#253;t jednotkou 
program, funkce, procedura, atd. Z pohledu objektov&#283; orientovan&#233;ho programov&#225;n&#237; je 
jednotkou obvykle t&#345;&#237;da. V r&#225;mci n&#237; se ale obvykle individu&#225;ln&#283; testuj&#237; jej&#237; metody (tj. 
&#269;lensk&#233; funkce).</i></span></font></div>
<div align="left" align="left"><font size="3"><span style=" font-size:12pt"><i><br />
</i></span></font></div>
<div align="left" align="left"><font size="3"><span style=" font-size:12pt"><i>Jednotkov&#253; test je test pro ur&#269;itou jednotku. V ide&#225;ln&#237;m p&#345;&#237;pad&#283; by m&#283;l b&#253;t ka&#382;d&#253; 
testovan&#253; p&#345;&#237;pad nez&#225;visl&#253; na ostatn&#237;ch. P&#345;i testov&#225;n&#237; se sna&#382;&#237;me testovanou &#269;&#225;st 
izolovat od ostatn&#237;ch &#269;&#225;st&#237; programu. Za t&#237;m &#250;&#269;elem se n&#283;kdy vytv&#225;&#345;ej&#237; pomocn&#233; 
objekty, kter&#233; simuluj&#237; p&#345;edpokl&#225;dan&#253; kontext, ve kter&#233;m testovan&#225; &#269;&#225;st pracuje (mock 
object).</i></span></font></div>
<div align="left" align="left"><font size="3"><span style=" font-size:12pt"><i><br />
</i></span></font></div>
<div align="left" align="left"><font size="3"><span style=" font-size:12pt"><i>Technika unit testing je jednou z kl&#237;&#269;ov&#253;ch sou&#269;&#225;st&#237; metodiky, kter&#225; se naz&#253;v&#225; extr&#233;mn&#237; 
programov&#225;n&#237;.</i></span></font></div>
</body>
</html>
