Repository: geniv/Goodflow
Catalog: goodflow_openttd/language/*/LC_MESSAGES/messages.po
Languages: cs

source: Select the pathfinding algorithm for road vehicles. YAPF is the default and recommended setting, but you can still select the older pathfinders.
cs: Vybrání algoritmu hledání cesty (pathfinding) pro silniční vozidla. YAPF je výchozí a doporučené nastavení, ale múžete si pořád vybrat starší "pathfinders".

source: All vehicles can have a depot in their schedule.
cs: Všechna vozidla mohou mít depo ve svém časovém plánu.

source: Vehicles will load cargo over a period of time, not full load instantly. If the option to show loading indicators is switched on, this will be reflected correctly.
cs: Vozidla budou nabírat náklad po určitou dobu, ne okamžité nabírání nákladu. Pokud je možnost zobrazení ukazatelů zapnutá, tohle bude promítnuto správně.

source: An improved loading algorithm, which loads only one vehicle at a time until it's completely full, before loading the next vehicle. When disabled, all vehicles in a station are loaded simultaineously, possibly needlessly blocking multiple platforms.
cs: Lepší vkládaný algoritmus, který načte pouze jedno vozidlo za čas dokud se nenačte před načtením dalšího vozidla. Pokud je vypnutý, všechna vozidla ve stanici jsou načtena zároveň, možné blokace více místa.

source: If you have breakdowns set to none and have this switch on, your vehicles will never go to the depot for a service. Even if this setting is enabled, vehicles will still go to depot for auto-renewal and/or replacement if those settings are activated.
cs: Méte-li poruchy nastaveny na "žádné" a chcete to zapnout, Vaše vozidla nikdy nebudou jezdit do depa na servis. I když je tohle nastavení povoleno, vozidla budou stále jezdit do depa pro automatické obnovení nebo výměnu, pokud jsou tyto nastavení aktivovány.

source: Cargo will only be generated at a station when a vehicle with the capacity to pick that cargo up has visited the station. Affects station ratings.
cs: Náklad bude pouze generován u stanice, když vozidlo s kapacitou pro náklad navštíví stanici. Tohle ovlivňuje hodnocení všech stanic.

source: When enabled, helicopters will be serviced automatically each time they arrive at a helipad. This way, you don't need to have some airport along the helicopter's route for it to service. In previous versions this was located in Stations section.
cs: Pokud je povoleno, helikoptéry budou automaticky obsluhovány pokaždé, když přistanou na přistávácí plochu pro helikoptéry. Tímto způsobem nepotřebujete mít některé další letiště pro helikoptéry a jejich služby. V předchozí verzi tohle bylo umístěno v sekci Stanice.

source: Allows you to use timetables for vehicles.
cs: Umožňuje Vám použít jízdní řády pro vozidla.

source: Own company
cs: Vlastní společnost

source: All companies
cs: Všechny společnosti

source: The advanced vehicle list allows to place vehicles in groups and perform certain actions on groups, such as replace vehicles and sending to depot.
cs: Seznam moderních vozidel umožňuje umístit vozidla do skupin a provádět určité skupinové akce, jako je například výměna vozidla a vyslání jej do depa.

source: always build infrastructure
cs: vždy stavět infrastrukturu

source: Every month
cs: Každý měsíc

source: Every 3 months
cs: Každé 3 měsíce

source: Every 6 months
cs: Každých 6 měsíců

source: Every 12 months
cs: Každých 12 měsíců

source: The Autosave option allows OpenTTD to automatically save your game at predefined intervals.
cs: Možnost automatického ukládání od OpenTTD umožňuje automaticky ukládat Vaši hru v předdefinovaných intervalech.

source: bridge pillars
cs: mostní pilíře

source: Year in which the papers appear in color.
cs: Rok, ve kterém se objeví barevné noviny.

source: Computer cannot build aircraft or airports. This option has been moved from Vehicles section in 0.3.4.
cs: Počítač nemůže postavit letadla nebo letiště. Tato možnost už byla přesunuta z Vozidel do sekce 0.3.4.

source: Computer cannot build road vehicles or roads. This option has been moved from Vehicles section in 0.3.4.
cs: Počítač nemůže postavit silniční vozidla nebo silnice. Tato možnost už byla přesunuta z Vozidel do sekce 0.3.4.

source: Computer cannot build trains or rail infrastucture. This option has been moved from Vehicles section in 0.3.4.
cs: Počítač nemůže postavit vlaky nebo železniční infrastrukturu. Tato možnost už byla přesunuta z Vozidel do sekce 0.3.4.

source: Computer cannot build ships. This option has been moved from Vehicles section in 0.3.4.
cs: Počítač nemůže postavit loď. Tato možnost už byla přesunuta z Vozidel do sekce 0.3.4.

source: Enables computer players in multiplayer games. The number of computer players can be set through the difficulty settings window.
cs: Umožňuje BOTs v multiplayer hře. Počet BOTs múže být nastavena skrze obížnost v nastavení v okně.

source: Lower this value if the AI is making the game run slow. Increase this value if you find the AI doing a lot of nothing instead of actually building stuff. Leave value at 10,000 if unsure.
cs: Tato hodnota je nižší v případě, jestli AI zpomaluje hru. Navýšte tuto hodnotu, pokud shledáte, že AI neděla nic kromě aktuálního stavění. Nechte to na hodnotě 10 000, pokud si nejste jisti.

source: For a custom currency
cs: Pro vlastní měnu

source: There are a variety of currencies that you can set as the standard currency of the server.
cs: Existují různé měny, které můžete nastavit jako standartní měnu serveru.

source: Metric
cs: Metrický

source: Units of distance
cs: Jednotky vzdáleností

source: Enable or disable autoclean function. If enabled, companies with no player activity for specified game (autoclean_protected and autoclean_unprotected) time will be destroyed.
cs: Povolit nebo zakázat funkci "autoclean". Pokud je povolena, společnosti bez aktivity od hráče pro specifickou hru (autoclean_protected a autoclean_unprotected) bude zničena.

source: Automatically shut down companies without vehicles after the given amount of months.
cs: Automaticky vypne firmy bez vozidel po zadaném počtu měsíců.

source: Automatically remove the password from an inactive company after the given amount of months.
cs: Automaticky vymaže heslo od neaktivních společností po zadaném počtu měsíců.

source: Automatically shut down inactive companies after the given amount of months.
cs: Automaticky vypne neaktivní firmy po vybraném počtu měsíců.

source: Defines the name you will have when you play multiplayer. It is considered polite not to leave the name as 'Player'. It doesn't have to be anything special, possibly your nickname, forename, initals, or use your imagination.
cs: Definuje jméno, které budete mít, když hrajete multiplayer. Je to považováno za zdvořilost nepojmenovávat hráče "Hráč". Nemusí to být nic zvláštního, zkuste třeba svoji přezdívku, prostřední jméno, iniciály nebo využíjte Vaši představivost.

source: This password will be set to every new company at their establishment.
cs: Tohle heslo bude nastaveno pro každou nově zřízenou společnost.

source: internet-visible, advertised on master server list
cs: internet-visible, oznámen seznamu hlavního serveru

source: LAN-only, not advertised.
cs: LAN-only, není zveřejněno.

source: This setting specifies whether you are running a LAN- or Internet-visible game server. An Internet-visible game will be advertised on the master server browser, allowing online players to join your game easily. Note that, even if you set the game to LAN-only, online players will still be able to join if it is possible to reach server_port from the Internet, by adding it manually to their personal server lists.
cs: Tohle nastavení určuje, zda používáte LAN nebo internet-visible server. Internet-visible - hra bude zveřejněna na seznamu hlavního serveru, který umožňuje online hráčům se připojit do Vaši hry snadněji. Všimněte si, že i když je hra v LAN-only, online hráči budou mít stále možnost se připojit, pokud je možné se dostat z internetu "server_port" manuálním přidáním.

source: Maximum number of players allowed on the server
cs: Maximální počet hráčů na serveru.

source: Maximum number of companies allowed in the game
cs: Maximální počet společností ve hře

source: Set the maximum amount of time (ticks) a client is allowed to join.
cs: Nastaví maximální čas, po který se klient může připojit.

source: This is how many spectators you allow on your server.
cs: Nastavení, kolik spectatorů je povoleno na Vašem serveru.

source: The game is atomatically paused when the number of active players is less than this amount. This only works with dedicated servers!
cs: Hra je automaticky pozastavena, když počet aktivních hráčů je menší, než tato částka. Tohle funguje pouze u dedikovaných serverů!

source: Specifies whether or not to pause the game while a new client joins.
cs: Určuje, zda zapauzovat či nezapauzovat hru, když se připojí nový hráč.

source: Configure the dedicated server to accept rcon commands
cs: Nakonfigurovat dedicated server pro přijímání RCON příkazů

source: reload cfg
cs: obnovit config

source: Config parameter restart_game_year is located in the [NETWORK] section of the OPENTTD.cfg. The value set to this parameter represents the year the server will restart. If the value is set to zero (0) the game will run until it is manually reset. When set, the server will perform a restart on January 1st of value.
cs: Konfigurační parametr "restart_game_year" se nachází v [NETWORK] sekci souboru OPENTTD.cfg. Nastavená hodnota parametru představuje rok, server bude restartován. Pokud je hodnota nastavena na nulu (0), hra poběží dokud nebude manuálně restartována. Pokud je nastavena, server provede restart 1. ledna nastaveného roku.

source: This setting may be either true or false. Set it to true if you wish advertise the server to the master server list at http://www.openttd.org/en/servers.
cs: Tohle nastavení může být buď pravdivé nebo nepravdivé. Nastavte ji na hodnotu "pravdivé", pokud si přejte vložit Vás server do seznamu serverů na http://www.openttd.org/en/servers.

source: IP-address to which the OpenTTD server will bind itself. If you have more than one network connection, you can select the network connection to be used. The default is 0.0.0.0, which means any network connection can be used.
cs: IP-adresa, na které se bude OpenTTD server bindovat. Pokud máte více než jedno síťové připojení, můžete vybrat síťové připojení k použítí. Výchozí je 0.0.0.0, což znamená, že každé síťové připojení může být používáno.

source: The language spoken on this server. It is shown by a flag in the server list.
cs: Jazyk, kterým se mluví na tomto serveru. Je zobrazeno vlajkou v seznamu serverů.

source: This is the name of your server as shown on the server list.
cs: Název vašeho serveru, které je uvedeno v seznamu serverů.

source: The password that client has to enter when he/she wants to connect to the server.
cs: Heslo, které klient musí zadat, když se chce připojit na server.

source: Port on which the OpenTTD server runs. The default is 3979. (It use 3978 to contact master server) OpenTTD uses TCP and UDP
cs: Port serveru, na kterém běží OpenTTD. Výchozí nastavení je 3979. (Používá se 3978 pro kontaktování hlavního serveru) OpenTTD používá TCP a UDP

source: he password clients of the admin interface have to specify in order to be able to use it. A good password should be chosen for security reasons, as the admin interface can be used to control the server (it supports sending RCON commands without any extra check for the RCON password). If no password is set the admin interface isn't activated and no listener is started on the port specified in server_admin_port. Even if the listener was started the server would reject any request for that interface as if the password was wrong, making sure the admin interface cannot be used with an empty password.
cs: Je třeba zadat heslo od klientů do administrace, aby bylo možno ji používat. Dobré heslo by mělo být vybráno z bezpečnostních důvodů, aby měl admin kontrolu nad serverem (podporuje odesílání RCON příkazů bez nějakých extra kontrol pro RCON heslo). Pokud neni heslo nastaveno, administrace nebude zaktivována a nebude možné naslouchat na portu dle server_admin_port. Ikdyž začal naslouchat, server by odmítl všechny požadavky. Pokud je špatné heslo, ujistěte se, že admin nemůže použít prázdné heslo.

source: Vehicles are automatically replaced when they get old, provided that the same vehicle type is still available for purchase.
cs: Vozidla jsou automaticky vyměněna, když zestárnou, za předpokladu, že stejný typ vozidla je stále pro Vás k dispozici ke koupi.

source: If autorenew is enabled, a vehicle is automatically renewed the next time it enters a service depot when its age reaches the set amount of months before or after its maximum age.
cs: Je-li automatické prodloužení povoleno, vozidlo je automaticky obnoveno při příštím vstupu do depa, když jeho stáří dosáhne stanoveného měsíce před nebo po jeho maximálním věku.

source: If autorenew is enabled and a vehicle is going to be replaced, the amount money of the player has needs to be more than this value plus the cost of the new vehicle. If the value is, for example, £200,000, a new vehicle costs £10,000 and you have £205,000, the vehicle will not be replaced. Instead, you will get a warning that autorenew has failed on that vehicle.
cs: Je-li automatické prodloužení povoleno a vozidlo se chystá být vyměněno, množství peněz hráče musí být větší, než tato hodnota a cena nového vozidla. Jestliže hodnota je, pro příklad, 200 000 liber, nové auto stojí 10 000 liber a Vy máte 205 000 liber, auto nebude vyměněno. Místo toho, budete varování, že automatické prodloužení selhalo.

source: renew keep length
cs: obnovení délky

source: Summarized
cs: Shrnuto

source: full
cs: plný

source: Sometimes conditions around a station change, causing it to accept new cargo or to stop accepting cargo. This is most likely to happen with Passenger, Mail and Goods stations, due to towns being reconstructed.
cs: Někdy se podmínky u stanic změní, díky tomu může a nemusí příjmout nový naklad. To se s největší pravděpodobností stane s cestujícími, poštou a zboží, kvůli rekonstrukci města.

source: Information about accidents (e.g. aircraft crashes, train collision, etc) and disasters (e.g. UFO landings)
cs: Informace o nehodách (např. havárie letadel, vlakové kolize, atd.) a katastrofy, pohromy (např. přistání UFO)

source: Information about player's vehicles (e.g. "Train 1 has too few orders in the schedule").
cs: Informace ohledně hráčova vozidla (např. "Vlak 1 má příliš málo příkazů v plánu").

source: E.g. "First train arrives at..." for competitors's stations
cs: Např. "První vlak přijede na..." pro stanici konkurenta

source: Arrival of first vehicle at player's station
cs: Příjezd prvního vozidla do stanice hráče

source: Closing of industries
cs: Zavření průmyslů

source: Information about production increase/decrease for industries.
cs: Informace o přirustku/úbytku produkce ve společnosti.

source: General information
cs: Všeobecné informace

source: Notifications about new vehicles being available.
cs: Informace ohledně nových vozidel jsou k dispozici.

source: Opening of industries
cs: Otevření průmyslů

source: Other industry production changes.
cs: Ostatní změny průmyslu.

source: Production changes of industries served by competitor(s).
cs: Změny produkce průmyslu obsluhované konkurencí.

source: Production changes of industries served by the company.
cs: Změny produkce průmyslu obsluhované společností.

source: Whenever a new subsidy is available or an existing subsidy is withdrawn you'll be notified.
cs: Kdykoliv bude k dispozici nová nebo existující dotace, budete upozorněni.

source: version number
cs: číslo verze

source: home
cs: domů

source: list configs
cs: výpis configů

source: entry page :)
cs: vstupní stránka

source: here select config file for loading
cs: Zde vyberte konfigurační soubor pro nahrání

source: config name
cs: Název configu

source: save configuration
cs: Uložit konfiguraci
