Repository: geniv/Goodflow
Catalog: goodflow_openttd/language/*/LC_MESSAGES/messages.po
Languages: cs

source: Whether or not to play sounds when a news item appears along the status bar. This is a client-setting only.
cs: Přehrát či nepřehrát zvuky, až se novinka objevý ve stavovém řádku. Jedná se pouze o nastavení klienta.

source: Sets, whether OpenTTD is supposed to run in fullscreen-mode. This is a client-setting only.
cs: Nastavení, má-li OpenTTD běžet v režimu celé obrazovky. Jedná se pouze o nastavení klienta.

source: The language file to use for strings in the game. This is a client-setting only. See the lang directory for possible files, filename is the one to use. filename is case sensitive.
cs: Jazykový soubor se používá pro řetězce ve hře. Jedná se pouze o nastavení klienta. Podívejte se to adresáře "lang" pro možné soubory, z nich se použije název souboru. Název souboru je citlivý na velikost písmen.

source: The resolution the game will run in. This is a client-setting only. Where x and y represent a linear length in pixels.
cs: Hra běží v rozlišení. Jedná se pouze o nastavení klienta. Kde x a y reprezentuje lineární délku v pixelech.

source: The format to use when taking screenshots. This is a client-setting only. "BMP" is the default setting
cs: Formát se použije při snímání obrazovky. Jedná se pouze o nastavení klienta. Implicitní nastavení je "BMP"

source: <empty> - Will use the best setting for your system (usually zlib, if support has been compiled in, otherwise none).
cs: <prázdný> - Bude použito nejlepší nastavení pro Váš systém (obvykle zlib, jestli už byla podpora sestavena, jinak žádné).

source: memory - Unknown, does not appear to work.
cs: pamět - Neznámá, nevypadá to tak, že pracuje.

source: lzo - Use lzo compression, does not appear to work.
cs: Izo - Použití Izo komprese, nevypadá to tak, že pracuje.

source: zlib - Use zlib compression. This is only available if you have the game compiled with zlib support.
cs: zlib - Použití zlib komprese. Tohle je přístupné tehdy, jestli už máte sestavenou hru s podporou zlib.

source: none - Use no compression.
cs: žádný - Nepoužívá se komprese.

source: The save game format to use. This is a client-setting only. This should only be used for testing only, as the best option for your system will be selected by default.
cs: Formát uložení hry k použití. Jedná se pouze o nastavení klienta. Tohle by mělo být používáno pouze pro testování, jako nejlepší možnost pro Váš systém bude nastavení na hodnotu deafult.

source: volume effect
cs: hlasitý efekt

source: music volume
cs: hlasitost hudby

source: launch music
cs: spuštění hudby

source: This setting defines whether or not the music tracks will be played on a random order.
cs: Tohle nastavení určuje, zda-li bude přehrávat hudební skladby náhodně či nikoliv.

source: very slow
cs: velmi pomalá

source: slow
cs: pomalá

source: medium
cs: střední

source: fast
cs: rychlá

source: very fast
cs: velmi rychlá

source: If competitors are set to greater than zero then, competitor speed sets the speed at which the AI competitors will build.
cs: Jestliže je nastavení soutěžících větší než nula, tak rychlost soutěžícího nastaví tu rychlost, kterou AI soutěžící bude stavět.

source: low
cs: nízká

source: high
cs: vysoká

source: Sets the cost of construction in the game.
cs: Nastavení ceny stavění ve hře.

source: easy-mode
cs: lehký-mód

source: normal-mode
cs: normální-mód

source: hard-mode
cs: těžký-mód

source: custom
cs: vlastní

source: Sets the pre-defined difficulty levels in the game.
cs: Nastavení předdefinované obtížnosti ve hře.

source: off - no disasters occur
cs: vypnuto - žádné katastrofy

source: on - disasters occur occasionally
cs: zapnuto - katastrofy se občas ukáží

source: Sets whether disasters off or on for a new map.
cs: Nastavení vypnutí či zapnutí katastrof pro novou mapu.

source: steady - smaller, more frequent changes
cs: stabilní - menší, časté změny

source: fluctuating - larger, less frequent changes
cs: kolísavé - větší, méně časté změny

source: Sets the economic condition for a new map.
cs: Nastavení ekonomické podmínky pro novou mapu

source: 2% interest
cs: 2% úrok

source: 3% interest
cs: 3% úrok

source: 4% interest
cs: 4% úrok

source: Sets the initial interest charged on loans for a new map.
cs: Nastavení počátečního úroku z úvěru pro novou mapu.

source: at end of line, and at stations
cs: na konci řádku, a na stanicích

source: at end of line only
cs: jen na konci řádku

source: Sets conditions where trains can reverse direction.
cs: Nastavení podmínek, kdy vlaky mohou převrátit směr.

source: Sets the maximum initial loan for a new game. Always in British Pounds. Changing the currency under the [locale] section or in the Game options window will modify the maximum loan amount by the exchange rate of the chosen currency. The maximum loan amount will increase over time if inflation is on in the [economy] section.
cs: Nastavení maximálního počátečního úvěru pro novou mapu. Vždy v Britských librách. Změna měny dle [národní] části nebo v možnostech hry se bude měnit maximální výše úvěru v kurzu zvolené měny. Maximální výše úvěru čas od času narůstá, pokud je inflace v [ekonomické] části.

source: Sets the number AI competitors in the game.
cs: Nastavení počtu AI soutěžících ve hře.

source: none
cs: žádný

source: very low
cs: velmi nízká

source: normal
cs: normální

source: Sets the frequency of industries for a new map.
cs: Nastaveni frekvenci průmyslů pro novou mapu.

source: industry density
cs: průmysl hustoty

source: Sets the number of towns created on a new map. The custom setting is modified by the custom_town_number setting in the [game_creation] section.
cs: Nastavení počtu měst, vytvořených v nové hře. Vlastní nastavení je upraveno "custom_town_number" nastavení v části [game_creation].

source: Sets the quantity of water features on a new map.
cs: Nastavení množství vodních prvků v nové mapě.

source: 1.5x the normal rate
cs: 1.5x běžné sazby

source: 2.0x the normal rate
cs: 2x běžné sazby

source: 3.0x the normal rate
cs: 3x běžné sazby

source: 4.0x the normal rate
cs: 4x běžné sazby

source: Sets the bonus multiplier for subsidies offered in the game.
cs: Nastavení násobícího bonusu na dotace, které jsou nabízeny ve hře

source: very flat
cs: velmi plochá

source: flat
cs: plochá

source: hilly
cs: kopcovitý

source: mountainous
cs: hornatý

source: Sets the terrain type for generating a new map.
cs: Nastavení typu terénu pro tvorbu nové mapy.

source: permissive
cs: shovívavý

source: tolerant
cs: tolerantní

source: hostile
cs: nepřátelský

source: Sets the city council's attitude toward area restructuring in the game. A player rated "poor" or worse by the council will not be allowed to place stations or demolish town roads, bridges or buildings. The less tolerant the council is set to be, the faster their rating will fall due to the demolition of town assets (including trees on otherwise open land). The council's rating will improve over time by effectively moving freight, mail and people to and from stations in the town's area of control.
cs: Nastavení postoje restrukturalizace k oblasti od rady města. Pokud je hráč ohodnocen "chudý" nebo húře od rady města nebude moct stavět stanice nebo bourat městské silnice, mosty nebo budovy. Čím je rada méně tolerantní, tím rychleji bude klesat jeho hodnocení v důsledku bourání městského majetku (včetně stromů na jinak otevřeném prostranstvím). Hodnocení rady se čas od času zlepší stěhováním nákladu, pošty, lidí a stanic v městské oblastni kontroly.

source: none (no breakdowns regardless of the condition of the vehicle)
cs: žádný (bez poruch, bez ohledu na stav vozidla)

source: reduced
cs: snížení

source: Sets the running (maintenance) costs level for all vehicles.
cs: Nastavení (údržby) provozních nákladů pro všechna vozidla.

source: french
cs: francouzština

source: german
cs: němčina

source: american
cs: americký

source: latin
cs: latinský

source: silly
cs: hloupý

source: swedish
cs: švédský

source: dutch
cs: holandský

source: finnish
cs: finský

source: polish
cs: polský

source: slovakish
cs: slovensky

source: norwegian
cs: norsky

source: hungarian
cs: maďarsky

source: austrian
cs: rakousky

source: romanian
cs: rumunsky

source: czech
cs: česky

source: swiss
cs: švýcarsky

source: danish
cs: dánsky

source: turkish
cs: turecky

source: italian
cs: italsky

source: catalan
cs: katalánština

source: Town name
cs: Jméno města

source: Temperate
cs: mírné

source: Sub-arctic
cs: Arktický

source: Sub-tropical
cs: Subtropický

source: There are 4 climates, Temperate, Sub-tropical, Sub-arctic and Toyland, each with its own landscape. Apart from a different set of graphics for the buildings and scenery, each one has a different set of vehicles and industries. Most vehicles are shared between climates, and Sub-arctic and Sub-tropical climates have an identical set of vehicles. The climate also affects characteristics of the game such as requirements for towns to grow, and growth-rate.
cs: K dispozici jsou 4 podnebí - Mírné, Subtropické, Arktické a Toyland, každé s vlastním prostředím.

source: indicates the snowline level.
cs: Ukazuje úroveň sněžné čáry

source: This setting allows you to determine at what "altitude" snow will appear.
cs: Tohle nastavení Vám umožní určit v jaké "výšce" se objeví sníh.

source: starting year [yyyy]
cs: od roku [rrrr]

source: This specifies the land generation system that you use, either the Original or Terra Genesis Perlin (TGP).
cs: Určuje generování systému, který používáte. Může být původní nebo Terra Genesis Perlin (TGP).

source: This option determines the maximum allowed distance (in tiles) from the edge of the map for an Oil Refinery.
cs: Tato volba určuje maximální povolenou vzdálenost (v dlaždicích) od okraje mapy na ropnou rafinérii.

source: very smooth
cs: velmi jemné

source: smooth
cs: jemné

source: rough
cs: hrubé

source: very rough
cs: velmi hrubé

source: Sets the smoothness
cs: Nastavení hladkosti

source: very high
cs: velmi vysoké

source: This sets the variety of distribution. See Variety_distribution for more info.
cs: Tohle nastavuje různé distribuce. Navštivte Variety_distribution pro více informací.

source: none tree placing
cs: Žádné umístění stromů

source: improved tree placing
cs: lepší umístění stromů

source: The Map size X determines the size and shape of your map. Your map must be a rectangle with sides of lengths in powers of 2, up to a limit of 2048 tiles in each direction. OpenTTD allows you to select the Map size in the map generation window. A large map gives you more space to spread out, but a smaller map will take less memory. Therefore, newer and faster computers will be able to handle a larger map with more efficiency whereas a smaller map will be best suited to older computers.
cs: Mapa velikosti X určuje velikost a tvar Vaší mapy. Vaše mapa musí být obdelník se stranami délky 2 až po 2048 dlaždic v každém směru. OpenTTD Vám umožnujě zvolit velikost mapy okně mapy. Velká mapa poskytuje více rozložení v prostoru, ale menší mapy zase zaberou méně paměti. Proto budo novější a rychlejší počítače zvládat větší mapy více efektivněji, ale zase menší mapy budou nejlepší volbou pro starší počítače.

source: The Map size Y determines the size and shape of your map. Your map must be a rectangle with sides of lengths in powers of 2, up to a limit of 2048 tiles in each direction. OpenTTD allows you to select the Map size in the map generation window. A large map gives you more space to spread out, but a smaller map will take less memory. Therefore, newer and faster computers will be able to handle a larger map with more efficiency whereas a smaller map will be best suited to older computers.
cs: Mapa velikosti X určuje velikost a tvar Vaší mapy. Vaše mapa musí být obdelník se stranami délky 2 až po 2048 dlaždic v každém směru. OpenTTD Vám umožnujě zvolit velikost mapy okně mapy. Velká mapa poskytuje více rozložení v prostoru, ale menší mapy zase zaberou méně paměti. Proto budo novější a rychlejší počítače zvládat větší mapy více efektivněji, ale zase menší mapy budou nejlepší volbou pro starší počítače.

source: Bitset of the borders that are water by creating an new game
cs: Nastaven

source: The custom setting is modified by the custom_town_number.
cs: Vlastní nastavení je upraveno tímto "custom_town_number".

source: Disables electrified railways. The electric trains will run on normal tracks when this setting is active and electrified railways are not available for purchase.
cs: Zakázání elektrifikovaných železnic. Pokud bude tohle nastavení aktivní, elektrické vlaky pojedou po normálních tratích, ale elekrifikované železnice nebudou pro nákup k dispozici.

source: When enabled, this Engine Pool feature allows multiple NewGRF vehicle sets to exist side-by-side. Without this feature, the maximum number of different vehicles is severely limited and vehicle sets of the same type will overwrite each others vehicles and functions. Note: using multiple vehicle sets side-by-side might result in very high or very low purchase and running costs for vehicles. Mixing wagons and trains from different train sets might result in graphical errors
cs: Pokud je povoleno, motor bazénu umožňuje více NewGRF sady vozidla vedle sebe. Bez této funkce, maximální počet různých vozidel je značně omezený a sety vozidla stejného typu se navzájem přepíší. Poznámka: používání více těchto setů vozidel vedle sebe může mít za následek velmi vysoké nebo velmi nízké pořizovací a provozní náklady pro vozidla. Míchání vozů a vlaků z různých vlakových souprav může vyústit ke grafickým chybám.

source: Extends every vehicles live by x years. takes values between 0 and 100
cs: Prodloužení doby životnosti každého vozidla o x let. nabývá hodnot mezi 0 a 100

source: The weight of freight trains is multiplied by the multiplier set here to simulate very heavy trains for more realism.
cs: Hmotnost nákladních vlaků se násobí koeficientem, který simuluje chování velmi těžkých vlaků více realisticky.

source: You can build extremely long trains, aka mammoth trains.
cs: Múžete postavit extrémně dlouhé vlaky, tzv. mamutí vlaky.

source: Set the amount of aircraft that a player can have.
cs: Nastavení množství letadel, které hráč může mít.

source: Set the amount of road vehicles that a player can have.
cs: Nastavení množství silničních vozidel, které hráč může mít.

source: Set the amount of ships that a player can have.
cs: Nastavení množství lodí, které hráč může mít.

source: Set the amount of trains that a player can have.
cs: Nastavení množství vlaků, které hráč může mít.

source: Old vehicles will stay in the vehicle list for you to choose and never become obsolete, so you can now run a Kirby with a Chiamera next to it! When enabling this setting in a running game, vehicles already disappeared from the list will not come back for purchase.
cs: Staré vozidla pro Vás zůstanou v seznamu vozidel k vybrání, které se nikdy nestanou zastaralé, takže nyní můžete spustit Kirby s Chiamera! Při povolení tohoto nastavení v běžící hře, vozidla zmizí ze seznamu a nebude už možná koupě zpět.

source: Set the probability of plane crashes. They can be disabled if this setting is set to 'none'.
cs: Nastavení pravděpodobnosti havárie letadla. Mohou být zakázány, pokud tohle nastaveni bude "prázdné"

source: Set the speed of aircraft in relation to rail, road and water vehicles. In plain TTD, the aircraft traveled at 1/4th of ground speed.
cs: Nastavení rychlosti letadla v souvislosti se železnicí, silniční a vodní vozidla. V dřívějším TTD, letadla cestovala 1/4 traťové rychlosti.

source: left
cs: levá

source: right
cs: pravá

source: Road side
cs: Silniční

source: The default service interval when a new aircraft is built., 0=disable, min 5
cs: Výchozí interval pro nově postavené letadlo., 0=vypnuto, min 5

source: When this switch is on the service intervals are considered to be in percents of the max. reliability rather than days. For example, if an engine has the max reliability of 80% and you set the service interval to 10% then it will go to depot at 72%.
cs: Pokud tento přepínač je zapnutý, servisní intervaly jsou považovány být v maximálních procentech spolehlivosti než ve dnech. Například, jestliže motor má maximální spolehlivost 80% a Vy nastavíte interval na 10%, pak to půjde do depa při 72%.

source: The default service interval when a new road vehicle is built.
cs: Výchozí nastavení intervalu, když je postaveno nové silniční vozidlo.

source: The default service interval when a new ship is built.
cs: Výchozí nastavení intervalu, když je postavena nová loď.

source: The default service interval when a new train is built.
cs: Výchozí nastavení intervalu, když je postaven nový vlak.

source: default
cs: výchozí

source: realistic
cs: realistický

source: Select the default or a more realistic acceleration calculation for trains. With this setting set to realistic, trains will travel faster up hill, but slower through tight corners. This option has been renamed from Enable realistic acceleration for trains.
cs: Výběr výchozího nebo více realistického zrychlení výpočtu pro vlaky. S realistickým nastavením, valky budou cestovat rychleji do kopce, ale pomaleji v úzkých zatáčkách. Tato možnost byla přejmenována z "Umožnit realistické zrychlení" pro vlaky.

source: Sets the steepness of slopes, trains will slow down more on slopes if this setting is set to a higher value. It only applies if the realistic acceleration model is selected.
cs: Nastaveni strmosti svahu. Vlaky zpomalí více na svahu, pokud je toto nastaveni nastaveno na vyšší hodnotě. Tohle platí pouze v případě, že je vybrán mód realistického zrychlení.

source: Some NewGRF's have wagon speed limits to make them more realistic, this option will enable/disable them.
cs: Některé NewGRF vozidla mají rychlostní limit, který je dělá více realistické. Tato možnost je může povolit/zakázat.

source: Normally you can only build tracks and roads on slopes parallel to the incline, with this setting enabled you can build nearly everything on a slope with foundations being built automatically.
cs: Za normálních okolností je možné pouze stavět koleje a silnice na svazích souběžně se sklonem. Pokud je toto nastavení povoleno, můžete stavět téměř vše na svazích s automaticky se stavějícími základy.

source: The town’s attitude is more lenient towards you removing their property.
cs: Městský přístup je k Vám více schovívavější při odstraňování jejich majetku.

source: Allows you to build very long bridges, much longer than before.
cs: Umožní Vám postavit velmi dlouhé mosty, o mnoho delší než dříve.

source: as other industries
cs: další průmyslová odvětví

source: prospecting
cs: vyhledávání

source: This setting will enable you to purchase and either prospect or place industries which create raw materials.
cs: Toto nastavení Vám umožní nákup, výhled nebo místo průmyslu, které vytvářejí suroviny.

source: It will be possible to build drive-through road stops on town owned roads.
cs: Bude možné stavět průjezdné silnice se zastávkou ve vlastnictví menšího města

source: only in rain forests
cs: pouze v deštných pralesech

source: everywhere
cs: všude

source: no options
cs: žádné volby

source: all features
cs: všechny funkce

source: This option lets you specify which options are allowed during a game break.
cs: Tato možnost Vám umožní specifikovat, které možnosti jsou povoleny během herní přestávky.

source: The maximum length of a bridge that will be build.
cs: Maximální délka mostu, který bude postaven.

source: The maximum length of a tunnel that will be build.
cs: Maximální délka tunelu, který bude postaven.

source: When disabled, towns don't build roads by themselves. In order for towns to grow, you have to provide the roads yourself (somewhat like SimCity, but without the zoning and stuff).
cs: Pokud je to vypnuté, menší města si sami nebudou stavet silnice. Pro růst menších měst musíte poskytnout sami silnice (něco jako SimCity, ale bez zónování atd...).

source: Allows you to bribe the local authority so that they increase your rating, if you are caught though you will be fined and won't be able to bribe them for a while.
cs: Umožňuje podplatit místní správy tak, aby se zvýšilo Vaše hodnocení, pokud jste byli chyceni - budete pokutován. I když budete mít pokutu, nebudete moci na chvíli uplácet.

source: Allows you to disable the purchase of exclusive transport rights in towns. Useful (to disable?) in multiplayer games.
cs: Umožňuje zakázat nákup exkluzivních práv dopravy v menších městech. Užitečné (zakázat?) ve hrách pro více hráčů.

source: Allows you to donate money to other companies.
cs: Umožňuje darovat peníze jiným společnostem.

source: Controls whether inflation is on or off. If inflation is on, the prices of everything will increase as you progress. To balance this increase, the maximum loan available to you will increase every few years.
cs: Určuje, zda inflace je zapnutá nebo vypnutá. Je-li inflace zapnutá, budou ceny všeho růst, dle Vašeho postupování. Z důvodu vyvážení tohoto nárůstu se maximální výše Vaší půjčky zvýší jednou za několik let.

source: Set how much larger a newly founded city is compared to a town.
cs: Nastavit o kolik je větší nově založené město ve srovnání s malým městem

source: Set how many of the towns will become cities. Cities are larger towns which are allowed to grow faster (see also next setting).
cs: Nastavit, kolik měst se stane velkoměsty. Velkoměsta jsou větší města, které umožňují rychlejší růst (viz také další nastavení).

source: Enable if towns should remove useless pieces of road to clean up dead ends.
cs: Povolit, pokud by měla města odstranit nepoužívané silnice nebo vyčistit slepé uličky.

source: This setting allows you to build two or more industries of the same type on land that comes under the jurisdiction of one town.
cs: Toto nastavení Vám umožní postavit 2 nebo více průmyslů stejného typu na pozemku, který spadá do působnosti města.

source: Changes in production will happen more frequently and by smaller percentages.
cs: Změny ve výrobě se budou dít častějí a to o malé procenta.

source: With this activated, the number of airports which can be placed in the vicinity of a town is not fixed anymore. Instead it depends upon the noise level of the airports, their distance to the town centre and the town's attitude.
cs: S touto aktivní možností, počet letišť, které mohou být umístěny v blízkosti města, není už pevně stanovena. Místo toho to teď závisí na hluku na letištích, jejich vzdálenosti od centra města a přístupnost města.

source: None
cs: žádný

source: Slow
cs: Pomalý

source: Fast
cs: rychle

source: Very fast
cs: Velmi rychle

source: Select how fast towns should grow. You can also completely disable town growth.
cs: Výběr, jak rychle města budou růst. Můžete také úplně vypnout růst měst.

source: better roads
cs: lepší silnice

source: 2x2 grid
cs: 2x2 pole

source: 3x3 grid
cs: 3x3 pole

source: Select how towns should build their roads. You can choose between the original algorithm, an improved algorithm, a 2x2 grid, a 3x3 grid or random. The random setting picks one of the four option randomly for each town. This option has been renamed from Select town road layout in 0.6.3.
cs: Zvolení, jak by měla stavět města jejich silnice. Můžete si vybrat mezi originálním algorytmem, lepším algorytmem, 2x2 nebo 3x3 pole a mezi náhodou. Náhodné nastavení vybere jednu ze čtyř možností náhodně pro každé město. Tato možnost byla přejmenována z "Select town road layout" v 0.6.3.

source: Disallows trains and ships from making sharp 90 degree turns. The NPF or YAPF pathfinder for trains needs to be enabled for this option to work for trains.
cs: Neumožní valkům a lodím dělat ostré zatáčky (90 stupňu). NPF nebo YAPF "pathfinder" pro valky potřebuje být zapnuté.
